Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FabricationRodsDisconnectedWarning Property
 The hanger rod was disconnected because there is no structural component above.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricationRodsDisconnectedWarning { get; }
Public Shared ReadOnly Property FabricationRodsDisconnectedWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricationRodsDisconnectedWarning {
	FailureDefinitionId^ get ();
}
static member FabricationRodsDisconnectedWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace